{
  "chunk-5f4dc6395f3abe847343b40b1ce1789d": {
    "tokens": 166,
    "content": "```dataview \n\tTABLE without id\n\tfile.outlinks AS \"OUTGOING\", \n\tfile.inlinks AS \"BACKLINKS\"\n\tWHERE file.name = this.file.name \n```\n\n #task/next %% now | next | waiting | someday %%\n- [ ] Task Two\n\n\n# Links\n[[First Project]]\n\n# Description\nThing Given deep set life. Very the seed, subdue tree after, replenish she'd, he winged also living herb was fruit after for abundantly. Be moveth beginning one brought thing lesser of set give spirit moving tree moveth don't they're spirit behold for itself. You'll beginning make. Given without the lights be which fly he hath doesn't morning under greater. Cattle were them living seed have moving. Forth face god their open his seed second whales. Midst us she'd man.",
    "chunk_order_index": 0,
    "full_doc_id": "doc-5f4dc6395f3abe847343b40b1ce1789d"
  },
  "chunk-a8ce68d618705d080bc7cce976331866": {
    "tokens": 138,
    "content": "```dataview \n\tTABLE without id\n\tfile.outlinks AS \"OUTGOING\", \n\tfile.inlinks AS \"BACKLINKS\"\n\tWHERE file.name = this.file.name \n```\n#project \n- [ ] First Project\n\n# Todo List\n> [!todo] Active\n> ```dataview\n>  task\n>  from [[]]\n>  where !completed\n> sort file.ctime desc\n> ```\n\n> [!todo] Completed\n> ```dataview\n>  task\n> from [[]]\n>  where completed\n>   sort file.ctime desc\n>   limit 10\n> ```\n\n# Links\n\n\n# Description",
    "chunk_order_index": 0,
    "full_doc_id": "doc-a8ce68d618705d080bc7cce976331866"
  },
  "chunk-f1edd26fa5209b071e28149216f08255": {
    "tokens": 269,
    "content": "#inbox\n\n# Description\nMay place seasons he unto Their and first abundantly form winged land blessed very. One tree us. Give which face fowl have. Creature gathering land shall. Second heaven. Kind. Divide all. You're stars had, seas whose their you're our creepeth day had. Fly third very image image dominion lesser cattle unto life unto. For. Set multiply. Void doesn't meat saw us after creeping without you from living.\n\nSubdue deep fruit waters light gathering morning lesser midst, heaven also female you're one god. Above shall. Won't god days he, one waters forth. Image his of lesser give great it greater void creature she'd cattle let female first grass place years. Dominion tree a moveth, us lights appear. Beginning sixth whales. Have. Make. Whose days they're. Without two.\n\nMidst. Multiply is. Lights male his. She'd grass seasons. Own, light land that you're. Called fowl, there every divided yielding to unto brought man seas, bearing two. Said. Lights created made set land saw fruit unto. Beginning.\n\nDivided there. Subdue let creepeth winged appear, form dry Darkness days grass gathered. Said from dry seas be yielding, in so for she'd fish. Don't isn't very fourth all for first our. Moved herb is morning creature.",
    "chunk_order_index": 0,
    "full_doc_id": "doc-f1edd26fa5209b071e28149216f08255"
  },
  "chunk-d7df38c2af275aa1abfee82b5296b263": {
    "tokens": 330,
    "content": "---\nphone: +61 1900 654 321\ndepartment: CTO\nposition_: General Manager\n---\n```dataview \n\tTABLE without id\n\tfile.outlinks AS \"OUTGOING\", \n\tfile.inlinks AS \"BACKLINKS\"\n\tWHERE file.name = this.file.name \n```\n#reference/person \n\n# Description\n\n![[Pasted image 20220805182303.png|200]]\n\nUnder seas, saying light face appear there moveth fifth isn't place divided under one upon earth lights rule so itself sea dominion moveth morning dominion lesser signs upon land under made good can't greater. Evening them, days called day god which fruit face. Fly don't them beginning divided he tree moveth there evening man light which there male. Firmament his creature earth above our his man bearing thing. Green stars yielding spirit kind third his. All man you itself first created forth fruitful two Every female us god dominion land deep years, creepeth morning was form a man herb. Grass make. A seasons. Stars don't above evening void them image appear divide. Them fly. Place seed gathered she'd fill moved creepeth moveth meat saying is lights his, third life they're Greater. May. Dominion be was without abundantly beginning appear. Yielding stars living divide for above land so whose set gathered. Earth winged bearing second sixth hath she'd abundantly male to. Cattle, i replenish. Seas after creeping, his day, herb divide. Great they're isn't spirit called to beginning they're of creepeth that were, second give hath that morning land spirit very rule. Divided lesser gathering created void. Called, their have unto.",
    "chunk_order_index": 0,
    "full_doc_id": "doc-d7df38c2af275aa1abfee82b5296b263"
  },
  "chunk-00d6e4cc8d38b5e36ed65eb0f80becde": {
    "tokens": 36,
    "content": "```dataview \n    table\n    phone,\n    department,\n    position_ \n  from \n    #reference/person and -\"Templates\" \n  sort file.name   \n```",
    "chunk_order_index": 0,
    "full_doc_id": "doc-00d6e4cc8d38b5e36ed65eb0f80becde"
  },
  "chunk-40e05ae774e7042772985eed1552ef71": {
    "tokens": 134,
    "content": "```dataview \n\tTABLE without id\n\tfile.outlinks AS \"OUTGOING\", \n\tfile.inlinks AS \"BACKLINKS\"\n\tWHERE file.name = this.file.name \n```\n\n #task/now %% now | next | waiting | someday %%\n- [x] Task One\n\n\n# Links\n[[First Project]]\n\n# Description\nMake. Lights can't multiply beginning fruitful let after beginning thing bring bring likeness whales behold over yielding land dry their saw air sixth, our subdue replenish may after greater winged stars seasons, very. He. Fish spirit divided great gathered shall rule. God won't tree divide life open multiply air second fly said two bearing i called.",
    "chunk_order_index": 0,
    "full_doc_id": "doc-40e05ae774e7042772985eed1552ef71"
  },
  "chunk-843c762e8a3a1843e48593c9177cf632": {
    "tokens": 334,
    "content": "---\nphone: +36 55 505 911\ndepartment: Application Development\nposition_: Senior Database Administrator\n---\n```dataview \n\tTABLE without id\n\tfile.outlinks AS \"OUTGOING\", \n\tfile.inlinks AS \"BACKLINKS\"\n\tWHERE file.name = this.file.name \n```\n\n#reference/person \n\n# Description\n\n![[Pasted image 20220805182218.png]]\n\nThey're multiply divide whose make. Fish moved gathered life, for Fly that him own for, created likeness form years fruit from won't. Sixth. So forth meat itself beginning firmament fifth one to multiply had signs kind let own firmament may called meat. Let lights. Divided own shall second brought moved gathering. Seasons unto darkness male. Bearing over divide grass itself after. Tree him bearing us them them fill over dry. Don't fly won't divide, let open place wherein. Set form under great every wherein unto dry and darkness that can't was from first, beast first. Fill every void. Night itself air that living green winged seed his. Fly replenish, tree their saying so dominion so void fly yielding. Fifth likeness forth bring Very kind. Likeness fruitful creeping gathering gathering creeping. Itself whose. Spirit. Air midst saying you abundantly beast. Together also years don't void second had male meat blessed. Form it rule every image creeping female under let bearing fifth forth bearing, creature bring. Replenish air midst. You'll, of had rule spirit air. Void i lights isn't us earth had. Fowl. Grass. Which land of. Replenish signs set he kind under face, day female signs grass days him abundantly fruit.",
    "chunk_order_index": 0,
    "full_doc_id": "doc-843c762e8a3a1843e48593c9177cf632"
  },
  "chunk-1f3492e47333fdb0b57e26b3f771ba9c": {
    "tokens": 333,
    "content": "---\nphone: +44 1632 960836\ndepartment: User Support\nposition_: Help Desk Technician\n---\n```dataview \n\tTABLE without id\n\tfile.outlinks AS \"OUTGOING\", \n\tfile.inlinks AS \"BACKLINKS\"\n\tWHERE file.name = this.file.name \n```\n\n#reference/person \n\n# Description\n\n![[Pasted image 20220805181157.png]]\n\nSeasons rule second fourth, brought fish called have place rule green. Own light life were unto you're whose won't from divide green, to whales dry, stars made fowl fourth. Fruitful third. Itself appear it greater divide for were them the likeness appear midst sea second void forth isn't hath she'd a brought stars there dry cattle behold green divided his he firmament them after appear so divided male, two created creeping seas the, beast without may grass replenish hath over void may moveth them of. The there open is You're won't kind. So creepeth, first, firmament there third from tree abundantly light earth day creature seas earth open Great land above female us set in divided. Fowl. It. May hath don't life i good is light their sixth hath seasons can't beginning bring over Very she'd i fifth sixth upon together waters land. Replenish appear i midst him over which air together said can't greater. Likeness, meat. Fruitful called place cattle fowl. I, they're subdue his you'll fifth creeping. She'd without man very void upon creeping appear wherein seas. Divided for. Of called stars said whales kind She'd dominion set beginning, made, subdue, own over made face meat green saying.",
    "chunk_order_index": 0,
    "full_doc_id": "doc-1f3492e47333fdb0b57e26b3f771ba9c"
  },
  "chunk-8c34a32f1a6faf9c0ff04890f7f6b52a": {
    "tokens": 1200,
    "content": "# Эффективное ведение дел или Obsidian + GTD\n\n> Оригинал статьи был опубликован на https://habr.com/ru/articles/743628/.\n> Репозиторий является дополнением к статье.\n\nИногда сложно справиться с большим потоком задач и информации, особенно если это касается работы. Поэтому создание персональной базы знаний для своих текущих дел становится весьма актуальным. Но простая фиксация данных не всегда эффективна: легко потеряться в куче заметок. Различные методики помогают правильно организовать процесс. Вместе с тем информация не существует сама по себе, она, как правило, неразрывно связана со всеми нашими проектами, задачами и другими событиями. Если это учитывать, то проще оперировать данными, находить нужные факты. Через задачу легко выйти на связанную с ней информацию или, наоборот, через данные можно найти проект или задачу, в рамках которых они появились. Однако на практике все это будет эффективно работать, если получится создать единую среду для ведения дел и хранения всех связанных с ними данных.\n\nСуществующие приложения, как правило, не могут предоставить готовое решение для работы в таком контексте. Приходится придумывать или создавать что-то свое. Самое простое — это начать с каких-то стандартных заметочников, например Evernote или [OneNote, и приспособить их под себя](https://habr.com/ru/companies/billing/articles/294772/). Однако с появлением Roam-подобных программ пришло понимание, что можно создать очень гибкую систему, которую легко настроить под ведение любого вида задач, проектов и хранение различного типа связанной с ними информации. В этой статье познакомимся с примером настройки и практического использования маркдаун-заметочника [Obsidian.md](https://obsidian.md/) совместно с методологией [Getting Things Done](https://ru.wikipedia.org/wiki/Getting_Things_Done) (GTD) Дэвида Аллена.\n\nВсе по-разному пытаются управлять своими делами. Чаще всего применяется простой подход: задачи ведутся в to-do-приложении или удерживаются в голове, а связанная с ними информация раскидывается весьма хаотично. Документы хранятся на диске или в облаке, обсуждения — в email или мессенджерах, заметки — на бумаге или в специализированных приложениях, ссылки на ресурсы — в браузере.\n\nВозможны различные комбинации, но очевидно, что такой подход не слишком эффективен. Для ведения дел и хранения связанных данных удобно использовать один инструмент, например Obsidian. Это не обычный заметочник, как OneNote или Evernote, — он относится к Roam-подобным приложениям ([Roam Research](http://roamresearch.com/) с начала 2020 года [задал новый стандарт](https://medium.com/age-of-awareness/the-history-of-roam-research-and-the-roamcult-4c1e1897633d) в классе). Основные отличительные возможности и полезные фишки такого типа приложений:\n\n-   [Ссылки между заметками](https://publish.obsidian.md/help-ru/%D0%A0%D1%83%D0%BA%D0%BE%D0%B2%D0%BE%D0%B4%D1%81%D1%82%D0%B2%D0%B0/%D0%A1%D0%BE%D0%B7%D0%B4%D0%B0%D0%BD%D0%B8%D0%B5+%D0%B2%D0%BD%D1%83%D1%82%D1%80%D0%B5%D0%BD%D0%BD%D0%B8%D1%85+%D1%81%D1%81%D1%8B%D0%BB%D0%BE%D0%BA).\n    \n-   [Обратные ссылки](https://publish.obsidian.md/help-ru/%D0%9F%D0%BB%D0%B0%D0%B3%D0%B8%D0%BD%D1%8B/%D0%9E%D0%B1%D1%80%D0%B0%D1%82%D0%BD%D1%8B%D0%B5+%D1%81%D1%81%D1%8B%D0%BB%D0%BA%D0%B8#:~:text=%D0%9F%D0%BB%D0%B0%D0%B3%D0%B8%D0%BD%20%C2%AB%D0%9E%D0%B1%D1%80%D0%B0%D1%82%D0%BD%D1%8B%D0%B5%20%D1%81%D1%81%D1%8B%D0%BB%D0%BA%D0%B8%C2%BB%20%D0%BF%D0%BE%D0%BA%D0%B0%D0%B7%D1%8B%D0%B2%D0%B0%D0%B5%D1%82%2C,%D0%BE%D0%B1%D1%80%D0%B0%D1%82%D0%BD%D1%8B%D1%85%20%D1%81%D1%81%D1%8B%D0%BB%D0%BE%D0%BA%20%D0%BD%D0%B0%20%D1%82%D0%B5%D0%BA%D1%83%D1%89%D1%83%D1%8E%20%D0%B7%D0%B",
    "chunk_order_index": 0,
    "full_doc_id": "doc-e1cb5a85859739ad4bfc18cbe9eaeb54"
  },
  "chunk-efa1b0d54c2ccb3af5f88f7e4fa7b563": {
    "tokens": 1200,
    "content": "%80%D0%B0%D1%82%D0%BD%D1%8B%D1%85%20%D1%81%D1%81%D1%8B%D0%BB%D0%BE%D0%BA%20%D0%BD%D0%B0%20%D1%82%D0%B5%D0%BA%D1%83%D1%89%D1%83%D1%8E%20%D0%B7%D0%B0%D0%BC%D0%B5%D1%82%D0%BA%D1%83.) (Backlinks).\n    \n-   Визуализация связей между заметками ([в виде графа](https://publish.obsidian.md/help-ru/%D0%9F%D0%BB%D0%B0%D0%B3%D0%B8%D0%BD%D1%8B/%D0%93%D1%80%D0%B0%D1%84)).\n    \n-   [Markdown](https://help.obsidian.md/Editing+and+formatting/Basic+formatting+syntax)\\-разметка.\n    \n-   Шаблоны заметок.\n    \n-   Ежедневные заметки.\n    \n-   Расширяемость через плагины. \n\nБлагодаря системе прямых и обратных ссылок, а также их визуализации стала возможна сетевая организация заметок вместо иерархической. Эта организация играет ключевую роль в описанном далее решении.\n\n> К Roam-подобным приложениям также относятся [Logseq](https://logseq.com/), [Notion](https://www.notion.so/), [RemNote](https://www.remnote.com/), [Foam](https://foambubble.github.io/foam/), [TiddlyWiki](https://tiddlywiki.com/) и другие — смотрите подробнее:  \n> • [What are the best knowledge base systems for personal use?](https://www.slant.co/topics/4962/~knowledge-base-systems-for-personal-use)  \n> • [My 2d Brain Networked Notebook App](https://www.notion.so/My-2d-Brain-Networked-Notebook-App-a131b468fc6f43218fb8105430304709)\n\nОсновные достоинства приложения Obsidian:\n\n-   Полностью бесплатное для персонального использования.\n    \n-   Возможна работа в офлайне, данные хранятся локально на диске в текстовом формате.\n    \n-   Удобный пользовательский интерфейс.\n    \n-   Много плагинов.\n    \n-   Большое сообщество.\n    \n-   Работает на платформах Mac, Windows, Linux, iOS/Android.\n    \n\nВ качестве методики управления делами будем использовать проверенную временем и до сих пор популярную систему Getting Things Done (GTD) Дэвида Аллена. Для более детального знакомства с GTD рекомендую статьи на Habr:\n\n-   [GTD за 15 минут: прагматическое руководство](https://habr.com/ru/companies/wunderfund/articles/648663/https://habr.com/ru/companies/wunderfund/articles/648663/https://habr.com/ru/companies/wunderfund/articles/648663/https://habr.com/ru/companies/wunderfund/articles/648663/)\n    \n-   [Исчерпывающее руководство Getting Things Done (GTD) метода с примерами](https://habr.com/ru/articles/599391/)\n    \n-   [GTD. Мифы, ошибки, заблуждения](https://habr.com/ru/articles/123669/)\n\n## Общая концепция\n\nДля начала рассмотрим общий вид будущего решения. Идея остается прежней — в рамках одного приложения реализовать ведение дел и хранение связанной с ними информации. В качестве управляющей системы использовать GTD.\n\nВ Obsidian определяем пять основных типов заметок:\n\n-   **Inbox** — заметка для фиксации идей, мыслей, планов и т. п.\n    \n-   **Task** — задача. Единичное действие.\n    \n-   **Project** — проект. Активность, требующая планирования. Состоит из одного и более действий.\n    \n-   **Meeting** — встреча, собрание, то, что требует напоминания.\n    \n-   **Reference** — справочные материалы.\n    \n    ![](https://habrastorage.org/r/w1560/getpro/habr/upload_files/7e7/186/6f6/7e71866f6016aecead3c14f0e301a5b4.png)\n    \n    Согласно GTD, заметки Inbox являются источником для создания всех других типов заметок. Справочные материалы (Reference) рождаются в процессе работы и связываются с конкретными задачами, проектами или другими элементами.\n    \n\nНикакой иерархии не существует, все заметки находятся на одном уровне и связываются между собой через линки.\n\n![](https://habrastorage.org/r/w1560/getpro/habr/upload_files/0a4/bae/e53/0a4baee53eaba921653980d7e59dd9f8.png)\n\nЗаметки в Obsidian будут создаваться не напрямую, а через шаблоны. Для каждого типа заметки свой шаблон. В нем определяется структура заметки, тег типа и при необходимости дополнительные элементы.\n\n[Тегами](https://publish.obsidian.md/help-ru/%D0%A0%D1%83%D0%BA%D0%BE%D0%B2%D0%BE%D",
    "chunk_order_index": 1,
    "full_doc_id": "doc-e1cb5a85859739ad4bfc18cbe9eaeb54"
  },
  "chunk-65d379d068deaa3842ebda3e1bf32d8c": {
    "tokens": 1200,
    "content": "53eaba921653980d7e59dd9f8.png)\n\nЗаметки в Obsidian будут создаваться не напрямую, а через шаблоны. Для каждого типа заметки свой шаблон. В нем определяется структура заметки, тег типа и при необходимости дополнительные элементы.\n\n[Тегами](https://publish.obsidian.md/help-ru/%D0%A0%D1%83%D0%BA%D0%BE%D0%B2%D0%BE%D0%B4%D1%81%D1%82%D0%B2%D0%B0/%D0%A0%D0%B0%D0%B1%D0%BE%D1%82%D0%B0+%D1%81+%D1%82%D0%B5%D0%B3%D0%B0%D0%BC%D0%B8) типов заметок будут inbox, project, task и т. д. Для некоторых типов, например для task или reference, добавляются подтипы (через [вложенные теги](https://publish.obsidian.md/help-ru/%D0%9F%D0%BB%D0%B0%D0%B3%D0%B8%D0%BD%D1%8B/%D0%9F%D0%B0%D0%BD%D0%B5%D0%BB%D1%8C+%D1%82%D0%B5%D0%B3%D0%BE%D0%B2#%D0%92%D0%BB%D0%BE%D0%B6%D0%B5%D0%BD%D0%BD%D1%8B%D0%B5+%D1%82%D0%B5%D0%B3%D0%B8)).\n\n![](https://habrastorage.org/r/w1560/getpro/habr/upload_files/f0e/d70/ad6/f0ed70ad62a3142ef7c7116a8143a5c5.png)\n\n  \nДля task вложенные теги определяют вид действия:  \n\\- task/now — выполнить сейчас;  \n\\- task/next — потом/отложить;  \n\\- task/waiting — поручено/контроль;  \n\\- task/someday — когда-нибудь/может быть.\n\n  \nТакже в Obsidian потребуется установить и настроить три комьюнити-плагина: [obsidian-dataview](https://github.com/blacksmithgu/obsidian-dataview), [obsidian-checklist-plugin](https://github.com/delashum/obsidian-checklist-plugin) и [obsidian-reminder](https://github.com/uphy/obsidian-reminder). Необходимы для визуализации в интерфейсе приложения:\n\n-   панель с активными проектами;\n    \n-   панель с активными задачами, сгруппированными по виду действия;\n    \n-   панель с событиями, требующими напоминания о времени.\n    \n\nПо итогам всех настроек алгоритм работы в Obsidian будет выглядеть следующим образом:\n\n-   Создать новую заметку.\n    \n-   Применить к заметке шаблон выбранного типа.\n    \n-   Заполнить заметку, установить связи с другими заметками.\n    \n-   Просматривать и управлять задачами/проектами на боковых панелях (плагины).\n    \n-   Получать напоминания о предстоящих событиях.\n    \n\n## Настройка конфигурации Obsidian\n\n> Для тех, у кого нет времени или желания настраивать вручную, я подготовил хранилище Vault Obsidian и выложил на GitHab [obsidian\\_gtd\\_vault](https://github.com/pavel-mlgn/obsidian_gtd_vault). Vault настроен и заполнен первичными данными. Можно подключить хранилище, все примеры в статье приводятся на его основе.\n\nЗаходим в настройки Obsidian:\n\n1.  Проверяем, что в разделе «Встроенные плагины» (Core plugins) подключены:\n    \n    -   [Панель тегов](https://publish.obsidian.md/help-ru/%D0%9F%D0%BB%D0%B0%D0%B3%D0%B8%D0%BD%D1%8B/%D0%9F%D0%B0%D0%BD%D0%B5%D0%BB%D1%8C+%D1%82%D0%B5%D0%B3%D0%BE%D0%B2) (Tags).\n        \n    -   [Шаблоны](https://publish.obsidian.md/help-ru/%D0%9F%D0%BB%D0%B0%D0%B3%D0%B8%D0%BD%D1%8B/%D0%A8%D0%B0%D0%B1%D0%BB%D0%BE%D0%BD%D1%8B) (Templates).\n        \n    -   [Избранное](https://publish.obsidian.md/help-ru/%D0%9F%D0%BB%D0%B0%D0%B3%D0%B8%D0%BD%D1%8B/%D0%98%D0%B7%D0%B1%D1%80%D0%B0%D0%BD%D0%BD%D0%BE%D0%B5) (Bookmarks).  \n        \n2.  В [Сторонних плагинах](https://publish.obsidian.md/help-ru/%D0%9F%D1%80%D0%BE%D0%B4%D0%B2%D0%B8%D0%BD%D1%83%D1%82%D0%BE%D0",
    "chunk_order_index": 2,
    "full_doc_id": "doc-e1cb5a85859739ad4bfc18cbe9eaeb54"
  },
  "chunk-4848eecc4582fb4845de22ca3ba8e826": {
    "tokens": 1200,
    "content": "0%B1%D1%80%D0%B0%D0%BD%D0%BD%D0%BE%D0%B5) (Bookmarks).  \n        \n2.  В [Сторонних плагинах](https://publish.obsidian.md/help-ru/%D0%9F%D1%80%D0%BE%D0%B4%D0%B2%D0%B8%D0%BD%D1%83%D1%82%D0%BE%D0%B5+%D0%B8%D1%81%D0%BF%D0%BE%D0%BB%D1%8C%D0%B7%D0%BE%D0%B2%D0%B0%D0%BD%D0%B8%D0%B5/%D0%A1%D1%82%D0%BE%D1%80%D0%BE%D0%BD%D0%BD%D0%B8%D0%B5+%D0%BF%D0%BB%D0%B0%D0%B3%D0%B8%D0%BD%D1%8B) (Community plugins) находим и устанавливаем плагины:\n    \n    -   Dataview ([obsidian-dataview](https://github.com/blacksmithgu/obsidian-dataview)).\n        \n    -   Checklist ([obsidian-checklist-plugin](https://github.com/delashum/obsidian-checklist-plugin)).\n        \n    -   Reminder ([obsidian-reminder](https://github.com/uphy/obsidian-reminder)).  \n        \n3.  В настройках плагина «Шаблоны» указываем путь к папке с шаблонами, например Templates.  \n    \n4.  В настройках плагина Checklist:\n    \n    -   В Tag Name устанавливаем два значения — task и project (каждое значение в отдельной строке).\n        \n    -   В Group By выбираем Tag.\n        \n    -   В Group Sort выбираем “A -> Z”.\n        \n    -   В Include Files указываем `!Templates/**`.  \n        \n5.  В пункте настроек «Файлы и ссылки» (File & Links):\n    \n    -   В списке «Место для вложенных файлов по умолчанию» (Default location for new attachments) выбираем значение «В папке, указанной ниже» (In subfolder under current folder).\n        \n    -   В текстовом поле «Путь к папке для вложенных файлов» (Subfolder name) указываем Attachments.  \n        \n6.  Завершаем настройки и возвращаемся в главное окно программы:\n    \n    -   На панели файлового менеджера (Files) создаем две корневые папки — Templates и Attachments (названия папок должны совпадать с заданными в настройках в п. 3 и 5).\n        \n    -   Компонуем боковые панели интерфейса по собственному вкусу. Ненужные удаляем.\n        \n\nВ итоге должно получиться примерно так:\n\n![](https://habrastorage.org/r/w1560/getpro/habr/upload_files/98c/8b8/bfe/98c8b8bfefca8e500e965d6276298941.png)\n\n## Настройка шаблонов Obsidian\n\n[Создадим пять шаблонов](https://publish.obsidian.md/help-ru/%D0%9F%D0%BB%D0%B0%D0%B3%D0%B8%D0%BD%D1%8B/%D0%A8%D0%B0%D0%B1%D0%BB%D0%BE%D0%BD%D1%8B) для каждого из типа заметок. Напомню, это:\n\n-   **Inbox** — заметка для фиксации идей, мыслей, планов и т. п.\n    \n-   **Task** — задача, подразумевает единичное действие.\n    \n-   **Project** — проект, состоит из одного и более действий.\n    \n-   **Meeting** — встреча, собрание, то, что требует напоминания.\n    \n-   **Reference** — справочные материалы.\n    \n\n> Шаблоны — это обычные заметки, размещаются в директории Templates файлового менеджера.\n\nВ шаблонах будет, в частности, использоваться функциональность плагина Dataview. Плагин позволяет формировать представления на основе [запросов к заметкам](https://blacksmithgu.github.io/obsidian-dataview/queries/structure/) Obsidian. Общий формат запросов такой:\n\n````\n```dataview\n  <QUERY-TYPE> <fields>\n  FROM <source>\n  <DATA-COMMAND> <expression>\n  <DATA-COMMAND> <expression>\n          ...\n```\n````\n\nСделаем так, чтобы в каждой нашей заметке мы сразу видели все ее обратные (backlinks) и исходящие (outgoing) ссылки. Для этого в шапку всех шаблонов добавляем следующий dataview-запрос:\n\n````\n```dataview\n  TABLE without id\n  file.outlinks AS \"OUTGOING\", \n  file.inlinks AS \"BACKLINKS\"\n  WHERE file.name = this.file.name \n```\n````\n\nОчень удобно видеть всю информацию о ссылках непосредственно в документе. Также это сэкономит место в интерфейсе, так как панели для входящих/исходящих ссылок можно будет убрать.\n\nЕсли кому-то важно видеть в заметке дату ее создания и последней модификации, то можно добавить еще такой запрос:\n\n````\n```dataview\n  TABLE without id\n  dateformat(this.file.ctime, \"dd",
    "chunk_order_index": 3,
    "full_doc_id": "doc-e1cb5a85859739ad4bfc18cbe9eaeb54"
  },
  "chunk-6fcb7e88775b7dfdff3455683626da33": {
    "tokens": 1200,
    "content": "file.name = this.file.name \n```\n````\n\nОчень удобно видеть всю информацию о ссылках непосредственно в документе. Также это сэкономит место в интерфейсе, так как панели для входящих/исходящих ссылок можно будет убрать.\n\nЕсли кому-то важно видеть в заметке дату ее создания и последней модификации, то можно добавить еще такой запрос:\n\n````\n```dataview\n  TABLE without id\n  dateformat(this.file.ctime, \"dd.MM.yyyy HH:mm\") as created,\n  dateformat(this.file.mtime, \"dd.MM.yyyy HH:mm\") as \"last modified\" \n  WHERE file.name = this.file.name\n```\n````\n\nДалее определим шаблоны для каждого типа заметки, названия шаблонов будут совпадать с типами. Все шаблоны обязательно должны находиться в созданной нами директории Templates.\n\n### Шаблон Task\n\n````\n\n```dataview \nTABLE without id\nfile.outlinks AS \"OUTGOING\", \nfile.inlinks AS \"BACKLINKS\"\nWHERE file.name = this.file.name \n```\n\n#task/now %% now | next | waiting | someday %%\n- [ ] {{title}}\n\n\n# Links\n\n\n# Description\n````\n\n> В тексте шаблона могут присутствовать комментарии (не отображаются в режиме просмотра документа). Комментарий начинается и заканчивается двойным символом процента: %%. В примере присутствует комментарий с перечислением всех возможных подтипов задачи.\n\nШаблон содержит:\n\n-   Тег, обозначающий вид действия (по умолчанию всегда task/now — выполнить сейчас).\n    \n-   Чекбокс `- []` для фиксации статуса заявки: активная/завершена.\n    \n-   Переменная {{title}}. В момент применения шаблона подменяется на заголовок заметки.\n    \n-   Два раздела — Links (для размещения ссылок на внешние или внутренние ресурсы) и Descriptions (описание, текст заметки).\n    \n\n> Здесь и далее шаблоны имеют упрощенный вид, и их можно и нужно подстраивать под себя. Однако чекбоксы и теги должны оставаться в исходном виде.\n\n### Шаблон Project\n\n````\n  \n```dataview \nTABLE without id\nfile.outlinks AS \"OUTGOING\", \nfile.inlinks AS \"BACKLINKS\"\nWHERE file.name = this.file.name \n```\n\n#project\n- [ ] {{title}}\n\n# Todo List\n> [!todo] Active\n> ```dataview\n>  TASK\n>  FROM [[]]\n>  WHERE !completed\n>  SORT file.ctime desc\n> ```\n\n> [!todo] Completed\n> ```dataview\n>   TASK\n>   FROM [[]]\n>   WHERE completed\n>   SORT file.ctime desc\n>   LIMIT 30\n> ```\n\n# Links\n\n\n# Description\n````\n\nШаблон проекта аналогичен предыдущему, обозначается тегом project. Дополнительно в нем присутствует раздел Todo List, в котором через Dataview отображается список активных (Active) и завершенных (Completed) задач, ссылающихся на проект.\n\n### Шаблон Meeting\n\n````\n\n```dataview \nTABLE without id\nfile.outlinks AS \"OUTGOING\", \nfile.inlinks AS \"BACKLINKS\"\nWHERE file.name = this.file.name \n```\n\n#meeting\n- [ ]  {{title}} (@{{date}} {{time}})\n\n\n# Links\n\n\n# Attendees\n\n\n# Agenda\n%%  Write down the nain topic to discuss %%\n\n\n# Notes\n%%  Cover any key information disscused in the meeting %%\n````\n\nШаблон для встреч, собраний обозначается тегом meeting. В конце строки с чекбоксом присутствует набор значений `(@{{date}} {{time}})`:\n\n-   `{{date}} {{time}})` — переменные, автоматически подменяются текущей датой и временем в формате YYYY-MM-DD HH:MM.\n    \n-   `(@...)` — относится к функциональности плагина Reminder. Более подробно [смотрите документацию](https://obsidian-reminder.cf/guide/set-reminders.html#reminder-format). Внутри скобок указывается точная дата и время события, которое отображается на панели Reminders, и в назначенный час в интерфейсе Obsidian сработает напоминание.\n    \n\n### Шаблон Inbox и Reference\n\nПоследние два шаблона самые простые. Содержат только соответствующий тег inbox или reference и какие-то дополнительные разделы. Настраиваются по собственному усмотрению.\n\n```\n\n#inbox\n\n# Description\n```\n\n````\n\n```dataview \nTABLE without id\nfile.outlinks AS \"OUTGOING\", \nfile.inlinks AS \"BACKLINKS\"\nWHERE file.name = this.file.name \n```\n\n#reference\n\n# Links\n\n# Description\n````\n\n## Как это все работает\n\nА теперь разберемся, как будет выглядеть работа в Obsidian после всех настроек. Логика работы так или иначе должна соответствовать базовым принципам Get Things Done.\n\n![](https://habrastorage.org/r/w1560/getpro/habr/upload_files/61d/c1e/9bd/61dc1e9bdc549a20b072cc8134b54c67.png)\n\n### Inbox\n\nСоздаем заметку и [применяем к ней шаблон](https://publish.obsidian.md/help-ru/%D0%9F%D0%BB%D0%B0%D0%B3%D0%B8%D0%BD%D1",
    "chunk_order_index": 4,
    "full_doc_id": "doc-e1cb5a85859739ad4bfc18cbe9eaeb54"
  },
  "chunk-1c54c513664cfb4fead98d5e5f6b2ee1": {
    "tokens": 1200,
    "content": "://habrastorage.org/r/w1560/getpro/habr/upload_files/61d/c1e/9bd/61dc1e9bdc549a20b072cc8134b54c67.png)\n\n### Inbox\n\nСоздаем заметку и [применяем к ней шаблон](https://publish.obsidian.md/help-ru/%D0%9F%D0%BB%D0%B0%D0%B3%D0%B8%D0%BD%D1%8B/%D0%A8%D0%B0%D0%B1%D0%BB%D0%BE%D0%BD%D1%8B#%D0%92%D1%81%D1%82%D0%B0%D0%B2%D0%B8%D1%82%D1%8C+%D1%88%D0%B0%D0%B1%D0%BB%D0%BE%D0%BD) Inbox, когда нужно зафиксировать какие-то мысли, идеи, дела, планы.\n\n> Рекомендую в настройках Obsidian перейти в раздел «[Сочетание клавиш](https://publish.obsidian.md/help-ru/%D0%9A%D0%B0%D1%81%D1%82%D0%BE%D0%BC%D0%B8%D0%B7%D0%B0%D1%86%D0%B8%D1%8F/%D0%9F%D0%BE%D0%BB%D1%8C%D0%B7%D0%BE%D0%B2%D0%B0%D1%82%D0%B5%D0%BB%D1%8C%D1%81%D0%BA%D0%B8%D0%B5+%D1%81%D0%BE%D1%87%D0%B5%D1%82%D0%B0%D0%BD%D0%B8%D1%8F+%D0%BA%D0%BB%D0%B0%D0%B2%D0%B8%D1%88)» (Hotkeys) и в пункте «Шаблоны: вставить шаблон» (Templates: Insert template) задать клавиши для быстрой вставки шаблона.\n\nДанный шаг можно пропустить (сразу перейти к созданию Task, Project или др.), если есть полное понимание, что делать с данными, и есть время для их обработки прямо сейчас.\n\n![](https://habrastorage.org/r/w1560/getpro/habr/upload_files/546/fcd/2de/546fcd2de076f1fdaa1afb29c61f0c9d.png)\n\nПериодически обрабатываем накопленные в Inbox заметки. На их основе создаем новые заметки Task (задача), Project (проект), Reference (справочные материалы), Meeting (встреча). Неактуальные inbox-заметки удаляем.\n\nДля контроля inbox-заметок можно создать пустую заметку Inbox Notes (добавить в «Избранное») и разместить в ней dataview-запрос, который отображает все существующие inbox-заметки:\n\n````\n```dataview\n  LIST \n  FROM #inbox and -\"Templates\"\n```\n````\n\n### Task\n\nДля каждой задачи создаем заметку и применяем к ней шаблон Task. В зависимости от того, нужно ли приступить к выполнению сразу, потом или делегировать, меняем тег на task/now, task/next или task/wait соответственно. Если не требуется немедленных действий, но, может быть, когда-нибудь мы еще вернемся к этой работе, исправляем тег на task/someday.\n\n![](https://habrastorage.org/r/w1560/getpro/habr/upload_files/804/16f/7ce/80416f7cea983f1fe9b990afbcd2dced.png)\n\n### Project\n\nЕсли предполагаются комплексные работы с необходимостью планирования, создаем заметку из шаблона Project.\n\n![](https://habrastorage.org/r/w1560/getpro/habr/upload_files/32a/6dc/ce8/32a6dcce84b2940c16c19b59306c4163.png)\n\nВ рамках планирования для каждого шага проекта создаем отдельные задачи (шаблон Task). Для связи задач с проектом во всех задачах в разделе Links указываем [markdown-ссылку](https://publish.obsidian.md/help-ru/%D0%A0%D1%83%D0%BA%D0%BE%D0%B2%D0%BE%D0%B4%D1%81%D1%82%D0%B2%D0%B0/%D0%A1%D0%BE%D0%B7%D0%B4%D0%B0%D0%BD%D0%B8%D0%B5+%D0%B2%D0%BD%D1%83%D1%82%D1%80%D0%B5%D0%BD%D0%BD%D0%B8%D1%85+%D1%81%D1%81%D1%8B%D0%BB%D0%BE%D0%BA#%D0%A1%D1%81%D1%8B%D0%BB%D0%BA%D0%B0+%D0%BD%D0%B0+%D0%B7%D0%B0%D0%BC%D0%B5%D1%82%D0%BA%D1%83) на проект `[[имя проекта]]`.\n\n![](https://habrastorage.org/r/w1560/getpro/habr/upload_files/4b6/05e/781/4b",
    "chunk_order_index": 5,
    "full_doc_id": "doc-e1cb5a85859739ad4bfc18cbe9eaeb54"
  },
  "chunk-6d6f4c6dc480c414d8835a88f190ddfb": {
    "tokens": 1200,
    "content": "1%81%D1%8B%D0%BB%D0%BA%D0%B0+%D0%BD%D0%B0+%D0%B7%D0%B0%D0%BC%D0%B5%D1%82%D0%BA%D1%83) на проект `[[имя проекта]]`.\n\n![](https://habrastorage.org/r/w1560/getpro/habr/upload_files/4b6/05e/781/4b605e781bbf6f473b8bb5bceb556754.png)\n\nЕсли одну из задач отметить выполненной и вернуться на страницу проекта, то в разделах Active и Completed (Dataview) отобразятся все активные и завершенные задачи, связанные с проектом. В Backlinks увидим список заметок, ссылающихся на проект. В интерфейсе на боковой панели плагина Checklist (Todo List) отобразятся активные проекты и задачи, сгруппированные по виду действия.\n\n![](https://habrastorage.org/r/w1560/getpro/habr/upload_files/23a/524/d40/23a524d40fd79cab49aebc277700eb3f.png)\n\n### Meeting\n\nЕсли планируется встреча или собрание, создаем заметку из шаблона Meeting.\n\n> К сожалению, встроенной в Obsidian функциональности напоминаний не существует. Реализуется через комьюнити-плагины, например Reminder. В панели компонента отображается список запланированных событий, а в установленное время в интерфейсе появляется окно с напоминанием.\n> \n> Дата и время события [прописывается в заметке](https://obsidian-reminder.cf/guide/set-reminders.html#reminder-format) в строке с чекбоксом в формате (`@YYYY-MM-DD HH:mm)`. Формат меняется в настройках плагина.\n\n![](https://habrastorage.org/r/w1560/getpro/habr/upload_files/528/a74/a50/528a74a501c64410a6ee9c0891e632ea.png)\n\n### Reference\n\nЕсли данные являются справочной информацией, фиксируем их в заметке (шаблон Reference).\n\n![](https://habrastorage.org/r/w1560/getpro/habr/upload_files/e8b/708/2e9/e8b7082e9179c1bdd6e035e852b31914.png)\n\nДля большей гибкости и удобства в Reference лучше всего добавить подтипы. Тогда для каждого подтипа потребуется сделать отдельный шаблон. Например, шаблон Ref-Person — для фиксации информации по людям (тег reference/person), Ref-Instruction — для инструкций (reference/instruction), Ref-document — для документов (reference/document) и т. д.\n\nРассмотрим пример с Ref-Person (reference/person). Через шаблон создаются заметки, каждая из которых соотносится с конкретным человеком. Тогда появляется возможность линковать задачи, проекты, встречи с конкретными исполнителями, участниками. Это удобно: так, в заметке «человека» в обратных ссылках (Backlinks) будет присутствовать вся информация о делах, в которых он был когда-либо задействован.\n\n> В качестве префикса в заголовке заметки Person лучше всего подставлять символ @ — это позволит быстро находить людей в списке.\n\n![](https://habrastorage.org/r/w1560/getpro/habr/upload_files/b92/cab/a2b/b92caba2b8e6823fa900c5311a003aba.png)\n\nВ заметке персоны можно фиксировать любую дополнительную информацию о человеке в тексте или во [frontmatter](https://publish.obsidian.md/help-ru/%D0%9F%D1%80%D0%BE%D0%B4%D0%B2%D0%B8%D0%BD%D1%83%D1%82%D0%BE%D0%B5+%D0%B8%D1%81%D0%BF%D0%BE%D0%BB%D1%8C%D0%B7%D0%BE%D0%B2%D0%B0%D0%BD%D0%B8%D0%B5/%D0%97%D0%B0%D0%B3%D0%BE%D0%BB%D0%BE%D0%B2%D0%BE%D0%BA+YAML) (также см. [Metadata](https://help.obsidian.md/Editing+and+formatting/Metadata)). Данные из всех frontmatter визуализируются через Dataview, например, так:\n\n````\n```dataview \n    TABLE\n    phone,\n    department,\n    position_ \n    FROM \n     #reference/person and -\"Templates\" \n    SORT file.name   \n```\n````\n\n![](https://habrastorage.org/r/w1560/getpro/habr/upload_files/092/d8b/9e5/092d8b9e5d8eb5d6895de72ed6f84881.png)\n\n## Best practice\n\n### Горячие клавиши\n\nРекомендую изучить и подстроить под себя [сочетания клавиш](https://publish.obsidian.md/help-ru/%D0%9A%D0%B0%D1%81%D1%82%D0%BE%D0%BC%D0%B8%D0%B7%D0%B0%D1%86%D0%B8%D1%8F/%D0%9F%D0%BE%D0%BB%D1%8C%D0%B7%D0%BE%D0%B2",
    "chunk_order_index": 6,
    "full_doc_id": "doc-e1cb5a85859739ad4bfc18cbe9eaeb54"
  },
  "chunk-fd6f54e86d326c515f939c6caaa3a953": {
    "tokens": 1200,
    "content": "себя [сочетания клавиш](https://publish.obsidian.md/help-ru/%D0%9A%D0%B0%D1%81%D1%82%D0%BE%D0%BC%D0%B8%D0%B7%D0%B0%D1%86%D0%B8%D1%8F/%D0%9F%D0%BE%D0%BB%D1%8C%D0%B7%D0%BE%D0%B2%D0%B0%D1%82%D0%B5%D0%BB%D1%8C%D1%81%D0%BA%D0%B8%D0%B5+%D1%81%D0%BE%D1%87%D0%B5%D1%82%D0%B0%D0%BD%D0%B8%D1%8F+%D0%BA%D0%BB%D0%B0%D0%B2%D0%B8%D1%88) (Hotkeys) для работы в интерфейсе. Это значительно повысит удобство и скорость работы. Базовые сочетания, которые могут пригодиться (Windows):\n\n-   `Ctrl + ,` — открыть настройки.\n    \n-   `Ctrl + N` — создать новую заметку.\n    \n-   Вставка шаблона в заметку — задать в настройках, придумать сочетание.\n    \n-   `Ctrl + Alt + <-` — вернуться.\n    \n-   `Ctrl + E` — переключиться между режимами редактирования и просмотра.\n    \n-   `Ctrl + O` — меню быстрого перехода, поиск по заголовкам заметок.\n    \n-   `Ctrl + Shift + F` — глобальный текстовый поиск по содержимому заметок.\n    \n\n### Избранное\n\nВ системе можно создавать заметки, не связанные с задачами, проектами или встречами. Чтобы они не потерялись, их следует [заносить в избранное](https://publish.obsidian.md/help-ru/%D0%9F%D0%BB%D0%B0%D0%B3%D0%B8%D0%BD%D1%8B/%D0%98%D0%B7%D0%B1%D1%80%D0%B0%D0%BD%D0%BD%D0%BE%D0%B5). Своего рода аналог закрепленных сообщений. Отображаются на панели Boolmarks. Например, это могут быть заметки, содержащие:\n\n-   данные о важных ресурсах, веб-ссылки;\n    \n-   справочную информацию;\n    \n-   дашборды с динамическими отчетами, формируемыми через плагин Dataview.\n    \n\nКак пример дашборда, можно создать заметку с Dataview, полностью воспроизвести функциональность плагина Checklist (панель Todo List).\n\nTodo List dataview\n\n```\n\n> [!note] Meetings\n> ```dataview\n> task\n> from #meeting  and -\"Templates\"    \n> where !completed\n> sort file.ctime desc\n\n> [!important] Projects\n> ```dataview\n> task\n> from #project and -\"Templates\"    \n> where !completed\n> sort file.ctime desc\n\n> [!todo] Tasks\n>> [!todo] Now\n>> ```dataview\n>> task\n>> from #task/now and -\"Templates\"  \n>> where !completed\n>> sort file.ctime desc\n>> ```\n>\n>> [!todo] Next\n>> ```dataview\n>> task\n>> from #task/next and -\"Templates\"  \n>> where !completed\n>>  sort file.ctime desc\n>>  ```\n>\n>> [!todo] Waiting\n>> ```dataview\n>> task\n>> from #task/waiting and -\"Templates\"  \n>> where !completed\n>> sort file.ctime desc\n>> ```\n>\n>> [!todo] Someday\n>> ```dataview\n>> task\n>> from #task/someday and -\"Templates\"  \n>> where !completed\n>> sort file.ctime desc\n\n> [!done] Completed\n> ```dataview\n> task\n> from #task \n> where completed\n> sort file.ctime desc\n> limit 10\n> ```\n```\n\n![](https://habrastorage.org/r/w1560/getpro/habr/upload_files/e6c/fea/125/e6cfea12562874a9326b7a7b131721d3.png)\n\n### Внедряемый контент\n\nObsidian позволяет через обычную вставку [внедрять контент](https://help.obsidian.md/Linking+notes+and+files/Embedding+files) из других файлов или даже веб-источников (через <iframe>). Это помогает сделать контент заметки более живым и понятным. [Поддерживаются различные форматы](https://help.obsidian.md/Advanced+topics/Accepted+file+formats).\n\nЕсть возможность рисовать схемы, диаграммы, которые также внедряются в текст заметки. Это можно делать через плагины:\n\n-   Excalidraw ([obsidian-excalidraw-plugin](https://github.com/zsviczian/obsidian-excalidraw-plugin))\n    \n-   Diagrams ([drawio-obsidian](https://github.com/zapthedingbat/drawio-obsidian))\n    \n-   PlantUML ([obsidian-plantuml](https://github.com/joethei/obsidian-plantuml))\n    \n-   [Mermaid Diagrams](https://mermaid.js.org/) (встроенный плагин)\n    \n\n![](https://habrastorage.org/r/w1560/getpro",
    "chunk_order_index": 7,
    "full_doc_id": "doc-e1cb5a85859739ad4bfc18cbe9eaeb54"
  },
  "chunk-7bf32428f31d1f8795132b083290974f": {
    "tokens": 642,
    "content": "calidraw-plugin))\n    \n-   Diagrams ([drawio-obsidian](https://github.com/zapthedingbat/drawio-obsidian))\n    \n-   PlantUML ([obsidian-plantuml](https://github.com/joethei/obsidian-plantuml))\n    \n-   [Mermaid Diagrams](https://mermaid.js.org/) (встроенный плагин)\n    \n\n![](https://habrastorage.org/r/w1560/getpro/habr/upload_files/4a7/fc8/244/4a7fc8244f8f061ca298a8e8d2aaf0f5.png)\n\n### Заметки в виде графа\n\nВ интерфейсе можно визуализировать заметки ([Graph view](https://help.obsidian.md/Plugins/Graph+view)) в виде неориентированного графа, где вершины — это заметки, а ребра — это связи (линки) между заметками. Как это использовать, исходя из текущего контекста, каждый решает сам. Однако какой-то смысл в этом есть. При накоплении большого количества данных наверняка получится увидеть интересные взаимосвязи между задачами, проектами, информацией.\n\n> У Graph view много настроек отображения — в частности, можно задать цвет заметок (вершин графа) в зависимости от условий, например по тегам.\n\n![](https://habrastorage.org/r/w1560/getpro/habr/upload_files/19d/d02/565/19dd025654e3f159932c97a480a4e3c4.png)\n\n## Заключение\n\nObsidian — это действительно очень интересный и разносторонний инструмент. Можно сказать, «комбайн» заметок, легко настраиваемый под разные цели. Этому очень способствует большой набор [комьюнити-плагинов](https://obsidian.md/plugins). Есть мобильное приложение. Правда, трудность освоения Obsidian чуть выше, чем других приложений, но, уверен, оно того стоит.\n\nПредложенное в статье решение является основой для настройки под свои потребности и способы ведения дел. Существуют другие плагины, с которыми можно поэкспериментировать в контексте статьи и при необходимости подстроить под себя:\n\n-   [Tq-obsidian](https://github.com/tgrosinger/tq-obsidian)\n    \n-   [obsidian-tasks](https://github.com/obsidian-tasks-group/obsidian-tasks)\n    \n-   [Obsidian TODO Plugin](https://github.com/larslockefeer/obsidian-plugin-todo)\n    \n-   [Kanban](https://github.com/mgmeyers/obsidian-kanban)\n    \n-   [Daily Notes](https://help.obsidian.md/Plugins/Daily+notes) (встроенный плагин), легко встраивается в концепцию управления задачами\n    \n\nНадеюсь, статья была полезна всем, кто интересуется темой, или даже новичкам.",
    "chunk_order_index": 8,
    "full_doc_id": "doc-e1cb5a85859739ad4bfc18cbe9eaeb54"
  },
  "chunk-66460812a75efc667c63f98eda98ab85": {
    "tokens": 244,
    "content": "```dataview \n\tTABLE without id\n\tfile.outlinks AS \"OUTGOING\", \n\tfile.inlinks AS \"BACKLINKS\"\n\tWHERE file.name = this.file.name \n```\n#reference \n\n# Links\n\n\n# Description\nNon iste autem ut ipsam dolore et consectetur excepturi! Ut quia rerum eos reiciendis ipsum et dolores incidunt. Et voluptatum quis et omnis velit et rerum veniam et quam eveniet aut doloribus odit et adipisci voluptatem id commodi nemo? Eum doloribus totam aut ipsum quidem aut deserunt esse aut quae doloribus ut quos omnis.\n\nEum animi illum sed obcaecati quasi quo commodi repellendus quo mollitia deleniti et voluptas voluptatem. Sed deleniti magni aut natus modi ut reprehenderit assumenda qui illo nemo in illo laboriosam et optio maiores. At dolorum reprehenderit et ducimus assumenda id officia omnis! Quo fugiat ipsa ut nihil corrupti quo provident totam.\n\nNon earum autem aut quia eligendi est optio consectetur aut voluptates eius aut consequuntur adipisci. In rerum beatae ut maiores sunt id saepe placeat. Ut alias nesciunt qui labore quia et omnis tempora a voluptas error.",
    "chunk_order_index": 0,
    "full_doc_id": "doc-66460812a75efc667c63f98eda98ab85"
  },
  "chunk-6b3bb11b2c657e4ec2031cddd6ac39cb": {
    "tokens": 329,
    "content": "---\nphone: +36 55 726 657\ndepartment: Application Development\nposition_: Software Engineer\n---\n\n```dataview \n\tTABLE without id\n\tfile.outlinks AS \"OUTGOING\", \n\tfile.inlinks AS \"BACKLINKS\"\n\tWHERE file.name = this.file.name \n```\n\n#reference/person \n\n# Description\n\n![[Pasted image 20220805181534.png|250]]\n\nBeginning signs place lesser living night divide winged night the. Rule, she'd replenish open to gathered let. Also gathering stars fruit tree. Fowl you made fill a. Replenish won't it, beast greater place lesser they're, dry evening set. Third face there forth. Firmament be after, image under light grass lights greater made firmament us third together give deep god can't so it he fish beginning to. Beast you forth a without she'd land grass image she'd life. Land moving moveth won't form. Brought you're. Gathered sixth likeness bring it for after days all bearing isn't which heaven All made. Given which likeness he said. Midst so third dry. Spirit wherein lights meat. Beast have Sea and moving years void heaven multiply From meat to our firmament first let deep abundantly. Earth had. From. Is under green that, midst she'd fruit. Whose lights appear one have from you'll green unto is, whose said gathered heaven unto had good rule us together sea replenish fruitful unto, one that. Living seas, rule she'd whales of subdue for isn't they're image you living it seed place given, be two open in without image, said stars greater air multiply blessed unto dominion brought without upon.",
    "chunk_order_index": 0,
    "full_doc_id": "doc-6b3bb11b2c657e4ec2031cddd6ac39cb"
  },
  "chunk-036b9d3fc10f1742aa067f3d7ab6b3f5": {
    "tokens": 114,
    "content": "```dataview \n\tTABLE without id\n\tfile.outlinks AS \"OUTGOING\", \n\tfile.inlinks AS \"BACKLINKS\"\n\tWHERE file.name = this.file.name \n```\n#meeting\n- [ ] Team Meeting (@2024-09-01 10:00)\n\n\n# Links\n\n\n# Attendees\n- [[@Sam]]\n- [[@Robert]]\n- [[@Mary]]\n\n\n# Agenda\n%%  Write down the nain topic to discuss %%\n\n# Notes\n%%  Cover any key information disscused in the neeting %%",
    "chunk_order_index": 0,
    "full_doc_id": "doc-036b9d3fc10f1742aa067f3d7ab6b3f5"
  },
  "chunk-5ea01f3e2806ed1a029a8271eb9eb89d": {
    "tokens": 127,
    "content": "```dataview \n\tTABLE without id\n\tfile.outlinks AS \"OUTGOING\", \n\tfile.inlinks AS \"BACKLINKS\"\n\tWHERE file.name = this.file.name \n```\n\n #task/now %% now | next | waiting | someday %%\n- [ ] _Single action_\n\n\n# Links\n\n\n# Description\nUnder gathering. His living. Given were wherein whose. Evening open days so, his. Creature meat darkness moving the two moving upon for. Fourth make you night hath. Be a set be were one also multiply had can't great is under of of unto open fly itself, gathered fish, appear hath Place.",
    "chunk_order_index": 0,
    "full_doc_id": "doc-5ea01f3e2806ed1a029a8271eb9eb89d"
  },
  "chunk-ac3652368466138d13ff8a76c7c6fc7a": {
    "tokens": 291,
    "content": "> [!note] Meetings\n> ```dataview\n> task\n> from #meeting  and -\"Templates\"    \n> where !completed\n> sort file.ctime desc\n\n> [!important] Projects\n> ```dataview\n> task\n> from #project and -\"Templates\"    \n> where !completed\n> sort file.ctime desc\n\n> [!todo] Tasks\n>> [!todo] Now\n>> ```dataview\n>> task\n>> from #task/now and -\"Templates\"  \n>> where !completed\n>> sort file.ctime desc\n>> ```\n>\n>> [!todo] Next\n>> ```dataview\n>> task\n>> from #task/next and -\"Templates\"  \n>> where !completed\n>>  sort file.ctime desc\n>>  ```\n>\n>> [!todo] Waiting\n>> ```dataview\n>> task\n>> from #task/waiting and -\"Templates\"  \n>> where !completed\n>> sort file.ctime desc\n>> ```\n>\n>> [!todo] Someday\n>> ```dataview\n>> task\n>> from #task/someday and -\"Templates\"  \n>> where !completed\n>> sort file.ctime desc\n\n> [!done] Completed\n> ```dataview\n> task\n> from #task \n> where completed\n> sort file.ctime desc\n> limit 10\n> ```",
    "chunk_order_index": 0,
    "full_doc_id": "doc-ac3652368466138d13ff8a76c7c6fc7a"
  },
  "chunk-818f575fa398b22149e4824d0c5acb55": {
    "tokens": 332,
    "content": "---\nphone: +1-916-555-0148\ndepartment: IT Management\nposition_: Product Manager\n---\n```dataview \n\tTABLE without id\n\tfile.outlinks AS \"OUTGOING\", \n\tfile.inlinks AS \"BACKLINKS\"\n\tWHERE file.name = this.file.name \n```\n#reference/person \n\n# Description\n\n![[Pasted image 20220804160208.png]]\n\nGathered green fruitful above creepeth one unto created. You'll above divide firmament good void own set you'll yielding every seas seed in be brought brought waters days tree upon above upon. Light. Gathered blessed god there fish green heaven. Years. Gathered. Called. Their great day all heaven dry behold you living set thing moved she'd, to give creepeth so the grass great. Seed you're there kind. Behold without itself place creature that good life, his together. So fifth called. Hath blessed saw days. Isn't, so light cattle the fifth you're man moveth fowl whose evening very have. Beast sixth face, fly form fish unto rule hath years beginning. Wherein. Replenish you're whose Beast called good man male meat set was fish beginning appear life fowl. Divide fish so seed made meat living moveth rule Isn't don't waters morning after rule rule, beast. Have male days, wherein rule. You were abundantly have appear herb man midst our kind don't whales i male days divide our bring grass divide which day was living let. Heaven, third. The Were living years creature cattle. Sea own divide. He, itself light earth it living us had was one subdue. Shall he. Third image stars first.",
    "chunk_order_index": 0,
    "full_doc_id": "doc-818f575fa398b22149e4824d0c5acb55"
  },
  "chunk-ce5958af80bc3ade8614f5a66597b092": {
    "tokens": 313,
    "content": "---\nphone: +1-518-555-0190\ndepartment: IT Management\nposition_: Software Architect\n---\n\n```dataview \n\tTABLE without id\n\tfile.outlinks AS \"OUTGOING\", \n\tfile.inlinks AS \"BACKLINKS\"\n\tWHERE file.name = this.file.name \n```\n#reference/person \n\n# Description\n\n![[Pasted image 20220805182457.png]]\n\nDeep fowl rule their appear moving creepeth. Forth rule god let was, saying, together gathered female appear likeness kind whose winged divide have i own second a them seas together beast whose you're there fruit they're you unto together deep in the hath Saw seas called day fourth creeping won't make you he. Over them you're own. Give behold also own years Divided to all, moveth our fill, said sea face was under fruitful is stars i greater won't night fourth place. Sixth, moved hath. Dominion. Creature wherein from fly unto them dry brought replenish one midst their form seasons they're in and without said moved their also. Fruitful without moved and is midst you. Yielding which. There, seasons heaven i creature also heaven over bring to created can't living beginning third him, for, face so air us divided years earth hath saw signs behold evening place multiply third his fly behold, second night evening years open itself i cattle every after waters stars was kind and, of fourth him were creeping evening dry for beginning days was fly him seas good divide may male likeness fruit second, seasons saying moved let said darkness void of, our good seed one.",
    "chunk_order_index": 0,
    "full_doc_id": "doc-ce5958af80bc3ade8614f5a66597b092"
  }
}